lambda/src/test/resources/Migrations/DigiSubs2025/01/subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accountId",
  "accountNumber": "accountNumber",
  "accountName": "accountName",
  "invoiceOwnerAccountId": "invoiceOwnerAccountId",
  "invoiceOwnerAccountNumber": "invoiceOwnerAccountNumber",
  "invoiceOwnerAccountName": "invoiceOwnerAccountName",
  "subscriptionNumber": "subscriptionNumber",
  "version": 12,
  "revision": "12.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2016-01-04",
  "serviceActivationDate": "2016-01-04",
  "customerAcceptanceDate": "2016-06-15",
  "subscriptionStartDate": "2016-06-15",
  "subscriptionEndDate": "2026-06-15",
  "lastBookingDate": "2025-06-15",
  "termStartDate": "2025-06-15",
  "termEndDate": "2026-06-15",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 14.99,
  "totalContractedValue": 1528.8,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": "2016-06-22T21:38:18.620Z",
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": "DGA38",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a129276976df790019771a286ba006c",
      "lastChangeType": "Remove",
      "productId": "2c92a0fb4edd70c8014edeaa4ddb21e7",
      "productName": "Digital Pack",
      "productSku": "ABC-00000005",
      "productRatePlanId": "2c92a0fb4edd70c8014edeaa4eae220a",
      "productRatePlanNumber": null,
      "ratePlanName": "Digital Pack Monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00266382",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a129276976df790019771a286bd006e",
          "originalChargeId": "2c92a0ff55528f1c01555ad7e77c757c",
          "productRatePlanChargeId": "2c92a0fb4edd70c9014edeaa50342192",
          "number": "C-00266382",
          "name": "Digital Pack Monthly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 9,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-06-15",
          "effectiveEndDate": "2023-12-15",
          "processedThroughDate": "2023-12-15",
          "chargedThroughDate": "2023-12-15",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 11.99,
          "dmrc": 0.0,
          "tcv": 1079.1,
          "dtcv": -71.94,
          "originalOrderDate": "2016-06-16",
          "amendedByOrderOn": "2023-11-12",
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 11.99,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP11.99",
          "price": 11.99,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a129276976df790019771a286c00071",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4edd70c8014edeaa4ddb21e7",
      "productName": "Digital Pack",
      "productSku": "ABC-00000005",
      "productRatePlanId": "2c92a0fb4edd70c8014edeaa4eae220a",
      "productRatePlanNumber": "PRP-00000022",
      "ratePlanName": "Digital Pack Monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04762428",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a129276976df790019771a286c30073",
          "originalChargeId": "8a1289ba8bb8b0b0018bc27ea3947c87",
          "productRatePlanChargeId": "2c92a0fb4edd70c9014edeaa50342192",
          "number": "C-04778256",
          "name": "Digital Pack Monthly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 3,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2023-12-15",
          "effectiveEndDate": "2026-06-15",
          "processedThroughDate": "2025-11-15",
          "chargedThroughDate": "2025-12-15",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 14.99,
          "dmrc": 0.0,
          "tcv": 449.7,
          "dtcv": 179.88,
          "originalOrderDate": "2023-11-12",
          "amendedByOrderOn": "2025-06-15",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 14.99,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP14.99",
          "price": 14.99,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-04550312",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2016-06-15",
      "endDate": "2026-06-15",
      "status": "Active"
    },
    {
      "startDate": "2026-06-15",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-06-15 04:29:26",
  "updateTime": "2025-11-15 04:21:44",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
