lambda/src/test/resources/Migrations/DigiSubs2025/02/subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accountId",
  "accountNumber": "accountNumber",
  "accountName": "accountName",
  "invoiceOwnerAccountId": "invoiceOwnerAccountId",
  "invoiceOwnerAccountNumber": "invoiceOwnerAccountNumber",
  "invoiceOwnerAccountName": "invoiceOwnerAccountName",
  "subscriptionNumber": "subscriptionNumber",
  "version": 12,
  "revision": "12.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2015-09-02",
  "serviceActivationDate": "2015-09-02",
  "customerAcceptanceDate": "2016-06-14",
  "subscriptionStartDate": "2016-06-14",
  "subscriptionEndDate": "2026-06-14",
  "lastBookingDate": "2025-06-14",
  "termStartDate": "2025-06-14",
  "termEndDate": "2026-06-14",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 14.98,
  "totalContractedValue": 1527.9,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": "2017-12-20T16:13:59.208Z",
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": "DGA38",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a1292769744db8601976c7127ab1759",
      "lastChangeType": "Remove",
      "productId": "2c92a0fb4edd70c8014edeaa4ddb21e7",
      "productName": "Digital Pack",
      "productSku": "ABC-00000005",
      "productRatePlanId": "2c92a0fb4edd70c8014edeaa4e8521fe",
      "productRatePlanNumber": null,
      "ratePlanName": "Digital Pack Quarterly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00265714",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1292769744db8601976c7127ae175b",
          "originalChargeId": "2c92a0fd5552834d01555ad7c7ad79d0",
          "productRatePlanChargeId": "2c92a0fb4edd70c9014edeaa4fd42186",
          "number": "C-00265714",
          "name": "Digital Pack Quarterly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 9,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToTermStart",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-06-14",
          "effectiveEndDate": "2023-12-14",
          "processedThroughDate": "2023-12-14",
          "chargedThroughDate": "2023-12-14",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 11.983333333,
          "dmrc": 0.0,
          "tcv": 1078.5,
          "dtcv": -71.9,
          "originalOrderDate": "2016-06-16",
          "amendedByOrderOn": "2023-11-11",
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 35.95,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP35.95",
          "price": 35.95,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a1292769744db8601976c7127b2175e",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4edd70c8014edeaa4ddb21e7",
      "productName": "Digital Pack",
      "productSku": "ABC-00000005",
      "productRatePlanId": "2c92a0fb4edd70c8014edeaa4e8521fe",
      "productRatePlanNumber": "PRP-00000020",
      "ratePlanName": "Digital Pack Quarterly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04758900",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1292769744db8601976c7127b41760",
          "originalChargeId": "8a129f7a8bb8ccfb018bbd231b263b25",
          "productRatePlanChargeId": "2c92a0fb4edd70c9014edeaa4fd42186",
          "number": "C-04774469",
          "name": "Digital Pack Quarterly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 3,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToTermStart",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2023-12-14",
          "effectiveEndDate": "2026-06-14",
          "processedThroughDate": "2025-09-14",
          "chargedThroughDate": "2025-12-14",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 14.98,
          "dmrc": 0.0,
          "tcv": 449.4,
          "dtcv": 179.76,
          "originalOrderDate": "2023-11-11",
          "amendedByOrderOn": "2025-06-14",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 44.94,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP44.94",
          "price": 44.94,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-04546764",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2016-06-14",
      "endDate": "2026-06-14",
      "status": "Active"
    },
    {
      "startDate": "2026-06-14",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-06-14 04:17:24",
  "updateTime": "2025-09-14 04:41:41",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
