lambda/src/test/resources/Migrations/ProductMigration2025N4/02/subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accountId",
  "accountNumber": "accountNumber",
  "accountName": "accountName",
  "invoiceOwnerAccountId": "invoiceOwnerAccountId",
  "invoiceOwnerAccountNumber": "invoiceOwnerAccountNumber",
  "invoiceOwnerAccountName": "invoiceOwnerAccountName",
  "subscriptionNumber": "subscriptionNumber",
  "version": 7,
  "revision": "7.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2024-01-31",
  "serviceActivationDate": "2024-01-31",
  "customerAcceptanceDate": "2024-02-10",
  "subscriptionStartDate": "2024-01-31",
  "subscriptionEndDate": "2027-01-31",
  "lastBookingDate": "2025-09-14",
  "termStartDate": "2026-01-31",
  "termEndDate": "2027-01-31",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 34.99,
  "totalContractedValue": 1183.34,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "d807a6eb-d25b-a0b3-0000-0000000148a6",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a129bd5993a10c301994a6e60d3509b",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fe7375d60901737c64808e4be1",
      "productRatePlanNumber": "PRP-00000154",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - Home Delivery",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05036730",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a129bd5993a10c301994a6e60d6509d",
          "originalChargeId": "8a1280478d8e4f9b018d9878c52f2c82",
          "productRatePlanChargeId": "2c92a0fe7375d60901737c6480bc4be3",
          "number": "C-05139432",
          "name": "Delivery-problem credit",
          "productRatePlanChargeNumber": "PRPC-00000254",
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-03-10",
          "effectiveEndDate": "2024-03-11",
          "processedThroughDate": "2024-03-11",
          "chargedThroughDate": "2024-03-11",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -4.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-02-11",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2024-02-11",
          "HolidayEnd__c": "2024-02-11",
          "ForceSync__c": null,
          "salesPrice": -4.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP-4",
          "price": -4.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a129bd5993a10c301994a6e60d950a0",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fe7375d60901737c64808e4be1",
      "productRatePlanNumber": "PRP-00000154",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - Home Delivery",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05034421",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a129bd5993a10c301994a6e60dc50a2",
          "originalChargeId": "8a1291fe8d8e6c71018d9364a6256d4c",
          "productRatePlanChargeId": "2c92a0fe7375d60901737c6480bc4be3",
          "number": "C-05137016",
          "name": "Delivery-problem credit",
          "productRatePlanChargeNumber": "PRPC-00000254",
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-03-10",
          "effectiveEndDate": "2024-03-11",
          "processedThroughDate": "2024-03-11",
          "chargedThroughDate": "2024-03-11",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -4.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-02-10",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2024-02-10",
          "HolidayEnd__c": "2024-02-10",
          "ForceSync__c": null,
          "salesPrice": -4.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP-4",
          "price": -4.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a129bd5993a10c301994a6e60df50a5",
      "lastChangeType": "Remove",
      "productId": "2c92a0ff55a0e4940155dfa589da2591",
      "productName": "Newspaper Delivery",
      "productSku": "ABC-00000013",
      "productRatePlanId": "2c92a0fd5614305c01561dc88f3275be",
      "productRatePlanNumber": "PRP-00000055",
      "ratePlanName": "Weekend",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05001236",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a129bd5993a10c301994a6e60e150a7",
          "originalChargeId": "8a12958d8d5ac001018d5e5db8192015",
          "productRatePlanChargeId": "2c92a0fd5614305c01561dc88f8975c8",
          "number": "C-05053146",
          "name": "Sunday",
          "productRatePlanChargeNumber": "PRPC-00000078",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-02-10",
          "effectiveEndDate": "2025-09-10",
          "processedThroughDate": "2025-09-10",
          "chargedThroughDate": "2025-09-10",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 16.0,
          "dmrc": 0.0,
          "tcv": 304.0,
          "dtcv": -266.83870968,
          "originalOrderDate": "2024-01-31",
          "amendedByOrderOn": "2025-08-06",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 16.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP16",
          "price": 16.0,
          "discountAmount": null,
          "discountPercentage": null
        },
        {
          "id": "8a129bd5993a10c301994a6e60e150a9",
          "originalChargeId": "8a12958d8d5ac001018d5e5db8202016",
          "productRatePlanChargeId": "2c92a0fd5614305c01561dc88fb875d0",
          "number": "C-05053147",
          "name": "Saturday",
          "productRatePlanChargeNumber": "PRPC-00000079",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-02-10",
          "effectiveEndDate": "2025-09-10",
          "processedThroughDate": "2025-09-10",
          "chargedThroughDate": "2025-09-10",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 15.99,
          "dmrc": 0.0,
          "tcv": 303.81,
          "dtcv": -266.671935486,
          "originalOrderDate": "2024-01-31",
          "amendedByOrderOn": "2025-08-06",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 15.99,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP15.99",
          "price": 15.99,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a129bd5993a10c301994a6e60e450ad",
      "lastChangeType": "Update",
      "productId": "2c92a0ff55a0e4940155dfa589da2591",
      "productName": "Newspaper Delivery",
      "productSku": "ABC-00000013",
      "productRatePlanId": "2c92a0fd5614305c01561dc88f3275be",
      "productRatePlanNumber": "PRP-00000055",
      "ratePlanName": "Weekend",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-06738481",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a129bd5993a10c301994a6e60e750af",
          "originalChargeId": "8a128284986aaecb01987cf6d9b37e92",
          "productRatePlanChargeId": "2c92a0fd5614305c01561dc88f8975c8",
          "number": "C-07017589",
          "name": "Sunday",
          "productRatePlanChargeNumber": "PRPC-00000078",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-09-10",
          "effectiveEndDate": "2027-01-31",
          "processedThroughDate": "2025-10-10",
          "chargedThroughDate": "2025-11-10",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 17.5,
          "dmrc": 0.0,
          "tcv": 291.854838713,
          "dtcv": 0.0,
          "originalOrderDate": "2025-08-06",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 17.5,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP17.5",
          "price": 17.5,
          "discountAmount": null,
          "discountPercentage": null
        },
        {
          "id": "8a129bd5993a10c301994a6e616350b6",
          "originalChargeId": "8a128284986aaecb01987cf6d9b37e93",
          "productRatePlanChargeId": "2c92a0fd5614305c01561dc88fb875d0",
          "number": "C-07017590",
          "name": "Saturday",
          "productRatePlanChargeNumber": "PRPC-00000079",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 2,
          "effectiveStartDate": "2025-10-10",
          "effectiveEndDate": "2027-01-31",
          "processedThroughDate": "2025-10-10",
          "chargedThroughDate": "2025-11-10",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 17.49,
          "dmrc": 0.01,
          "tcv": 274.198064519,
          "dtcv": 274.198064519,
          "originalOrderDate": "2025-09-14",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 17.49,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP17.49",
          "price": 17.49,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-05035081",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2024-01-31",
      "endDate": "2027-01-31",
      "status": "Active"
    },
    {
      "startDate": "2027-01-31",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-09-14 23:52:51",
  "updateTime": "2025-10-10 04:00:50",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
