lambda/src/test/resources/Migrations/SupporterPlus2026/01/subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accountId",
  "accountNumber": "accountNumber",
  "accountName": "accountName",
  "invoiceOwnerAccountId": "invoiceOwnerAccountId",
  "invoiceOwnerAccountNumber": "invoiceOwnerAccountNumber",
  "invoiceOwnerAccountName": "invoiceOwnerAccountName",
  "subscriptionNumber": "subscriptionNumber",
  "version": 1,
  "revision": "1.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2026-06-30",
  "serviceActivationDate": "2026-06-30",
  "customerAcceptanceDate": "2026-06-30",
  "subscriptionStartDate": "2026-06-30",
  "subscriptionEndDate": "2027-06-30",
  "lastBookingDate": "2026-06-30",
  "termStartDate": "2026-06-30",
  "termEndDate": "2027-06-30",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "USD",
  "contractedMrr": 15.0,
  "totalContractedValue": 180.0,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "SyncDate__NS": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "IntegrationStatus__NS": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SalesOrder__NS": null,
  "OpportunityCloseDate__QT": null,
  "Project__NS": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "IntegrationId__NS": null,
  "LastPlanAddedDate__c": "2026-06-30",
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a128f5e9f01fcf4019f1af23b1d7f59",
      "productId": "8a12865b8219d9b4018221061563643f",
      "productName": "Supporter Plus",
      "productSku": "ABC-00000032",
      "productRatePlanId": "8a128ed885fc6ded018602296ace3eb8",
      "productRatePlanNumber": "PRP-00000180",
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-08081003",
      "isFromExternalCatalog": false,
      "originalRatePlanId": "8a128f5e9f01fcf4019f1af23b1d7f59",
      "ratePlanCharges": [
        {
          "id": "8a128f5e9f01fcf4019f1af23ad97f52",
          "originalChargeId": "8a128f5e9f01fcf4019f1af23ad97f52",
          "productRatePlanChargeId": "8a128ed885fc6ded018602296af13eba",
          "number": "C-08366322",
          "name": "Supporter Plus Monthly Charge",
          "productRatePlanChargeNumber": "PRPC-00000280",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2026-06-30",
          "effectiveEndDate": "2027-06-30",
          "processedThroughDate": "2026-06-30",
          "chargedThroughDate": "2026-07-30",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 15.0,
          "dmrc": 15.0,
          "tcv": 180.0,
          "dtcv": 180.0,
          "originalOrderDate": "2026-06-30",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 15.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "isLastSegment": true,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "USD15",
          "price": 15.0,
          "discountAmount": null,
          "discountPercentage": null,
          "originalListDiscountAmount": null,
          "originalListDiscountPercentage": null
        },
        {
          "id": "8a128f5e9f01fcf4019f1af23ad97f51",
          "originalChargeId": "8a128f5e9f01fcf4019f1af23ad97f51",
          "productRatePlanChargeId": "8a128d7085fc6dec01860234cd075270",
          "number": "C-08366321",
          "name": "Contribution",
          "productRatePlanChargeNumber": "PRPC-00000281",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2026-06-30",
          "effectiveEndDate": "2027-06-30",
          "processedThroughDate": "2026-06-30",
          "chargedThroughDate": "2026-07-30",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2026-06-30",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "isLastSegment": true,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "USD0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null,
          "originalListDiscountAmount": null,
          "originalListDiscountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-06791489",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2026-06-30",
      "endDate": "2027-06-30",
      "status": "Active"
    },
    {
      "startDate": "2027-06-30",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2026-07-01 00:51:50",
  "updateTime": "2026-07-01 00:51:50",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null,
  "totalNumberOfChargeSegments": 2,
  "gu:sanitised": true
}
