lambda/src/test/resources/Migrations/SupporterPlus2026/02/subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accountId",
  "accountNumber": "accountNumber",
  "accountName": "accountName",
  "invoiceOwnerAccountId": "invoiceOwnerAccountId",
  "invoiceOwnerAccountNumber": "invoiceOwnerAccountNumber",
  "invoiceOwnerAccountName": "invoiceOwnerAccountName",
  "subscriptionNumber": "subscriptionNumber",
  "version": 13,
  "revision": "13.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2017-08-02",
  "serviceActivationDate": "2017-08-02",
  "customerAcceptanceDate": "2017-08-02",
  "subscriptionStartDate": "2017-08-02",
  "subscriptionEndDate": "2026-08-02",
  "lastBookingDate": "2025-08-02",
  "termStartDate": "2025-08-02",
  "termEndDate": "2026-08-02",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 12.0,
  "totalContractedValue": 762.68,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "SyncDate__NS": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "IntegrationStatus__NS": null,
  "ReaderType__c": null,
  "ActivationDate__c": "2023-07-30T05:50:16.164881",
  "UserCancellationReason__c": null,
  "SalesOrder__NS": null,
  "OpportunityCloseDate__QT": null,
  "Project__NS": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "IntegrationId__NS": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a129c93984474b10198691289717610",
      "lastChangeType": "Remove",
      "productId": "8a12865b8219d9b4018221061563643f",
      "productName": "Supporter Plus",
      "productSku": "ABC-00000032",
      "productRatePlanId": "8a128ed885fc6ded018602296ace3eb8",
      "productRatePlanNumber": null,
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04472030",
      "isFromExternalCatalog": false,
      "originalRatePlanId": "8a128810899d0b850189a54dbff3487b",
      "ratePlanCharges": [
        {
          "id": "8a129c93984474b10198691289747614",
          "originalChargeId": "8a128810899d0b850189a54dbff3487d",
          "productRatePlanChargeId": "8a128ed885fc6ded018602296af13eba",
          "number": "C-04473275",
          "name": "Supporter Plus Monthly Charge",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2023-07-30",
          "effectiveEndDate": "2024-10-30",
          "processedThroughDate": "2024-10-30",
          "chargedThroughDate": "2024-10-30",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.0,
          "dmrc": 0.0,
          "tcv": 150.0,
          "dtcv": -90.96774194,
          "originalOrderDate": "2023-07-30",
          "amendedByOrderOn": "2024-09-27",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 10.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "isLastSegment": true,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP10",
          "price": 10.0,
          "discountAmount": null,
          "discountPercentage": null,
          "originalListDiscountAmount": null,
          "originalListDiscountPercentage": null
        },
        {
          "id": "8a129c93984474b10198691289747612",
          "originalChargeId": "8a128810899d0b850189a54dbff3487c",
          "productRatePlanChargeId": "8a128d7085fc6dec01860234cd075270",
          "number": "C-04473274",
          "name": "Contribution",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2023-07-30",
          "effectiveEndDate": "2024-10-30",
          "processedThroughDate": "2024-10-30",
          "chargedThroughDate": "2024-10-30",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2023-07-30",
          "amendedByOrderOn": "2024-09-27",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "isLastSegment": true,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null,
          "originalListDiscountAmount": null,
          "originalListDiscountPercentage": null
        }
      ]
    },
    {
      "id": "8a129c93984474b10198691289797618",
      "lastChangeType": "Add",
      "productId": "8a12865b8219d9b4018221061563643f",
      "productName": "Supporter Plus",
      "productSku": "ABC-00000032",
      "productRatePlanId": "8a128ed885fc6ded018602296ace3eb8",
      "productRatePlanNumber": "PRP-00000180",
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05713281",
      "isFromExternalCatalog": false,
      "originalRatePlanId": "8a129b5d92230040019232bc00685483",
      "ratePlanCharges": [
        {
          "id": "8a129c93984474b101986912897c761c",
          "originalChargeId": "8a129b5d92230040019232bc007a5485",
          "productRatePlanChargeId": "8a128ed885fc6ded018602296af13eba",
          "number": "C-05959736",
          "name": "Supporter Plus Monthly Charge",
          "productRatePlanChargeNumber": "PRPC-00000280",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-10-30",
          "effectiveEndDate": "2026-08-02",
          "processedThroughDate": "2026-06-30",
          "chargedThroughDate": "2026-07-30",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 12.0,
          "dmrc": 0.0,
          "tcv": 253.161290328,
          "dtcv": 144.0,
          "originalOrderDate": "2024-09-27",
          "amendedByOrderOn": "2025-08-02",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 12.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "isLastSegment": true,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP12",
          "price": 12.0,
          "discountAmount": null,
          "discountPercentage": null,
          "originalListDiscountAmount": null,
          "originalListDiscountPercentage": null
        },
        {
          "id": "8a129c93984474b101986912897c761a",
          "originalChargeId": "8a129b5d92230040019232bc00705484",
          "productRatePlanChargeId": "8a128d7085fc6dec01860234cd075270",
          "number": "C-05959735",
          "name": "Contribution",
          "productRatePlanChargeNumber": "PRPC-00000281",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-10-30",
          "effectiveEndDate": "2026-08-02",
          "processedThroughDate": "2026-06-30",
          "chargedThroughDate": "2026-07-30",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-09-27",
          "amendedByOrderOn": "2025-08-02",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "isLastSegment": true,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null,
          "originalListDiscountAmount": null,
          "originalListDiscountPercentage": null
        }
      ]
    },
    {
      "id": "8a129c93984474b101986912897f7620",
      "lastChangeType": "Remove",
      "productId": "2c92a0fe5aacfabe015ad24bf6e15ff6",
      "productName": "Contributor",
      "productSku": "ABC-00000028",
      "productRatePlanId": "2c92a0fc5aacfadd015ad24db4ff5e97",
      "productRatePlanNumber": null,
      "ratePlanName": "Monthly Contributon",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01077368",
      "isFromExternalCatalog": false,
      "originalRatePlanId": "2c92a0ff5d82a7a2015da23c2dac4ffb",
      "ratePlanCharges": [
        {
          "id": "8a129c93984474b10198691289827622",
          "originalChargeId": "2c92a0ff5d82a7a2015da23c2db74ffc",
          "productRatePlanChargeId": "2c92a0fc5aacfadd015ad250bf2c6d38",
          "number": "C-01077368",
          "name": "Monthly Contribution",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 7,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2017-08-02",
          "effectiveEndDate": "2023-07-30",
          "processedThroughDate": "2023-07-30",
          "chargedThroughDate": "2023-07-30",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.0,
          "dmrc": 0.0,
          "tcv": 359.51612903,
          "dtcv": -0.48387097,
          "originalOrderDate": "2017-08-02",
          "amendedByOrderOn": "2023-07-30",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 5.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "isLastSegment": true,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP5",
          "price": 5.0,
          "discountAmount": null,
          "discountPercentage": null,
          "originalListDiscountAmount": null,
          "originalListDiscountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-04784322",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2017-08-02",
      "endDate": "2026-08-02",
      "status": "Active"
    },
    {
      "startDate": "2026-08-02",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-08-02 05:37:59",
  "updateTime": "2026-06-30 04:26:59",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null,
  "totalNumberOfChargeSegments": 5,
  "gu:sanitised": true
}
